### Plan for staging
🟡 Modify module.event_sourcing.aws_glue_schema.event_glue_schema["AbTestChangeEvent"]
🟠 Replace module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"]
🟠 Replace module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"]
🟠 Replace module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition

**0 to add, 1 to modify, 3 to replace, 0 to delete**

<details><summary>Show detailed plan</summary>

```terraform
Terraform will perform the following actions:

  # module.event_sourcing.aws_glue_schema.event_glue_schema["AbTestChangeEvent"] will be updated in-place
  ~ resource "aws_glue_schema" "event_glue_schema" {
        id                    = "arn:aws:glue:eu-west-1:545209064596:schema/automotive/AbTestChangeEvent"
      ~ schema_definition     = jsonencode(
          ~ {
              ~ properties = {
                  ~ eventData       = {
                      ~ allOf = [
                          ~ {
                              ~ properties  = {
                                  ~ abChangeType              = {
                                      ~ enum        = [
                                            "STARTED",
                                          + "RESTARTED",
                                            "DISTRIBUTION_CHANGE",
                                          - "SEGMENT_CHANGE",
                                          - "COMPLETED",
                                          + "STOPPED",
                                            "REALLOCATED",
                                        ]
                                        # (2 unchanged attributes hidden)
                                    }
                                    # (2 unchanged attributes hidden)
                                }
                                # (2 unchanged attributes hidden)
                            },
                            {
                                description = "The event payload."
                            },
                        ]
                    }
                    # (4 unchanged attributes hidden)
                }
                # (2 unchanged attributes hidden)
            }
        )
        tags                  = {}
        # (10 unchanged attributes hidden)
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "2258979612912838435" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-08T16:19:22Z" -> (known after apply)
        }
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "1321611071415850535" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-08T16:19:22Z" -> (known after apply)
        }
    }

  # module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "service_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:545209064596:task-definition/ab-testing:14" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:545209064596:task-definition/ab-testing" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "DD_TRACE_SAMPLE_RATE"
                            value = "0.5"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "0.0.12-64" -> "0.0.13-65"
                        },
                        {
                            name  = "cloud.aws.credentials.instanceProfile"
                            value = "true"
                        },
                        # (5 unchanged elements hidden)
                    ]
                  ~ image            = "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.12-64" -> "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.13-65"
                  - mountPoints      = []
                    name             = "ab-testing"
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints  = []
                    name         = "datadog-agent"
                  - volumesFrom  = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - environment           = []
                  - mountPoints           = []
                    name                  = "aws-for-fluent-bit"
                  - portMappings          = []
                  - volumesFrom           = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints      = []
                    name             = "envoy"
                  - portMappings     = []
                  - volumesFrom      = []
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ab-testing" -> (known after apply)
      ~ revision                 = 14 -> (known after apply)
      ~ tags                     = {
            "service" = "ab-testing"
          ~ "version" = "0.0.12-64" -> "0.0.13-65"
        }
      ~ tags_all                 = {
          ~ "version"        = "0.0.12-64" -> "0.0.13-65"
            # (6 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Warning: Argument is deprecated

  with module.event_sourcing.module.table.snowflake_table.this,
  on .terraform/modules/event_sourcing.table/snowflake/modules/table/main.tf line 21, in resource "snowflake_table" "this":
  21:   data_retention_days = 7

Use data_retention_time_in_days attribute instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: staging.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "staging.plan"

```
</details>